[
    {
      "id": "624b37abbb47d276c9cf0395",
      "rating": 3,
      "name": "Cornelia Kinney",
      "peview": "The HP EliteBook 840 G7 is a well-built 14-inch business laptop with a good selection of ports and connectors, LTE mobile broadband and great battery life. The EliteBook series are well-known for their reliability and they age really good through time because of the design and the embedded materials."
    },
    {
      "id": "624b37abb021e7fae2f36f81",
      "rating": 3.5,
      "name": "Elaine Burton",
      "peview": "The ThinkPad X1 Carbon isn't just the best Lenovo laptop, it's one of the best laptops on the market. Great for business users but also students or everyday users who want a lightweight machine, the X1 Carbon weighs just over 2 pounds yet delivers fast performance in a military-tested chassis."
    },
    {
      "id": "624b37abdb0e67e2140655f1",
      "rating": 2,
      "name": "Claire Bowers",
      "peview": "Why Is Dell'S Customer Service So Bad? Dell has been forced to outsource customer service to India owing to a notoriously poor reputation, which it feels is a requirement. Customer service reps living in India are less focused on fulfilling customer expectations because they are disconnected from the company's culture."
    },
    {
      "id": "624b37ab2efaba9e4aeeda8e",
      "rating": 5,
      "name": "Mari Boyle",
      "peview": "The estimated average life of HP laptops is between 5 and 6 years when it comes to high-end devices. However, budget-friendly and inexpensive HP models last 3 to 4 years on average. These laptops will last longer than expected if you can handle HP devices with proper care and maintenance."
    },
    {
      "id": "624b37ab5e6ef460d126f374",
      "rating": 4.5,
      "name": "Shirley Spears",
      "peview": "The MacBook Air is Apple's most popular laptop, and for good reason. It's thin and light, performs very well, and is the most affordable laptop Apple sells. At the end of 2020, it got its first major revision in a long time as one of the first Mac models to be powered by Apple Silicon"
    },
    {
      "id": "624b37aba53359b61bf89cff",
      "rating": 4,
      "name": "Beulah Stanton",
      "peview": "The Asus TUF A15 is a brilliant affordable gaming laptop that manages to strike the right balance between performance and value. It's strong 1080p performance, tough build quality, and large selection of ports will win it a lot of fans, especially amongst competitive esports players."
    }
  ]