[
    {
      "id": "624b37abbb47d276c9cf0395",
      "rating": 3,
      "name": "Cornelia Kinney",
      "peview": "If you're looking for a cheap but capable Android smartphone, the Xiaomi Redmi 9T is definitely up to the task. The phone features solid hardware, good cameras, and a huge battery that will last for days. There some performance drop problem. Xiaomi should fix this problem by there next update."
    },
    {
      "id": "624b37abb021e7fae2f36f81",
      "rating": 3.5,
      "name": "Elaine Burton",
      "peview": "The Xiaomi Mi 11 is one of the best premium phones you should consider buying, as it's well-specced in almost every department: it has super-fast processing, a high screen resolution with extra display modes, and some camera modes and features the competition lacks."
    },
    {
      "id": "624b37abdb0e67e2140655f1",
      "rating": 2,
      "name": "Claire Bowers",
      "peview": "With so-so battery life, poor camera zoom, and no IP rating, I'd be more tempted to spend my money with Google or Samsung this time around. The OnePlus 9 is the brand's most comprehensive affordable flagship, but you still can't have it all at this price."
    },
    {
      "id": "624b37ab2efaba9e4aeeda8e",
      "rating": 5,
      "name": "Mari Boyle",
      "peview": "The Samsung Galaxy S21 Ultra led the charge for the best Android phones in 2021. It packs in all of the features you could possibly want in a phone, especially if you prefer big screens. While it lags behind some of other top contenders, it's still a very good device for any Android fan out there."
    },
    {
      "id": "624b37ab5e6ef460d126f374",
      "rating": 4.5,
      "name": "Shirley Spears",
      "peview": "The iPhone 13 is the newer model, offering the better chipset, cameras, battery life and some new software tricks too. The iPhone 12 however has the advantage of being notably cheaper, with Apple keeping it on as a mid-range model (along with the iPhone 12 mini) for the time being."
    },
    {
      "id": "624b37aba53359b61bf89cff",
      "rating": 4,
      "name": "Beulah Stanton",
      "peview": "In our review, we found out that Redmi Note 10 Pro Max has a great design. It is equipped with a brilliant set of cameras and sports an excellent 120Hz high-refresh rate display. All in all, it's a great device to purchase if you're concerned about 5G."
    }
  ]